Tekla.Structures.ModelInternal.dotBoltGroup_t.HoleType
HoleType.

Tekla.Structures.ModelInternal.dotBoltGroup_t.SlottedHoleX
Slotted Hole X.

Tekla.Structures.ModelInternal.dotBoltGroup_t.SlottedHoleY
Slotted Hole Y.

Tekla.Structures.ModelInternal.dotBoltGroup_t.RotateSlots
Rotate Slots.